# Taps
tap "github/gh"
tap "heroku/brew"

# Core Development Tools
brew "git"                   # Version control
brew "node"                  # JavaScript runtime
brew "python@3.12"          # Python runtime
brew "zsh"                  # Shell
brew "curl"                 # HTTP client
brew "wget"                 # File downloader

# Command Line Utilities
brew "bat"                  # Better cat
brew "gh"                   # GitHub CLI
brew "mas"                  # Mac App Store CLI
brew "trash"                # Safer rm alternative
brew "diff-so-fancy"        # Better git diff

# Development Tools
brew "nvm"                  # Node version manager

# Shell Enhancements
brew "zsh-completions"      # Shell completions
brew "zsh-history-substring-search"  # Better history search
brew "zsh-syntax-highlighting"       # Syntax highlighting

# Design & Development Apps
cask "cursor"               # AI-powered IDE
cask "figma"                # Design tool
cask "visual-studio-code"   # Code editor

# System Tools
cask "cleanshot"            # Screenshot tool
cask "docker"               # Container platform
cask "iterm2"               # Terminal emulator
cask "logitech-options"     # Logitech device management

# Communication
cask "slack"                # Team communication

# Productivity
cask "anylist"              # Shopping and task lists

# Backup
cask "backblaze"            # Cloud backup

# Fonts
cask "font-input"           # Input font
cask "font-inter"           # Inter font

# Web Browsers
cask "google-chrome"        # Web browser
