tap "dart-lang/dart"
tap "ethereum/ethereum"
tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "sass/sass"
tap "teamookla/speedtest"
brew "act"
brew "zstd"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "openssl@3"
brew "protobuf"
brew "llvm"
brew "apr-util"
brew "automake"
brew "boost"
brew "libusb"
brew "libusb-compat"
brew "avrdude"
brew "pycparser"
brew "cffi"
brew "cryptography"
brew "python@3.12"
brew "awscli"
brew "bat"
brew "bootloadhid"
brew "brew-cask-completion"
brew "glib"
brew "cairo"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "openblas"
brew "suite-sparse"
brew "ceres-solver"
brew "clang-format"
brew "cmake"
brew "libyaml"
brew "cocoapods"
brew "coreutils"
brew "curl"
brew "dfu-programmer"
brew "dfu-util"
brew "diff-so-fancy"
brew "exa"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "leptonica"
brew "libass"
brew "libbluray"
brew "libmicrohttpd"
brew "librist"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "ffmpeg@4"
brew "ffmpeg@6"
brew "freetds"
brew "node"
brew "fx"
brew "fzf"
brew "libavif"
brew "gd"
brew "hdf5"
brew "libheif"
brew "netcdf"
brew "numpy"
brew "gdal"
brew "gh"
brew "ghostscript"
brew "gifsicle"
brew "openvino"
brew "gifski", link: false
brew "git"
brew "git-delta"
brew "gitlab-runner"
brew "glab"
brew "glow"
brew "gobject-introspection"
brew "graphicsmagick"
brew "guile"
brew "htop"
brew "hub"
brew "liblqr"
brew "libraw"
brew "imagemagick"
brew "mas"
brew "neovim"
brew "nginx"
brew "nmap"
brew "nvm"
brew "qt"
brew "pyqt"
brew "vtk"
brew "opencv"
brew "openvpn"
brew "pillow"
brew "postgresql@14", restart_service: true
brew "pyenv"
brew "qt@5"
brew "pyqt@5"
brew "python@3.9"
brew "python-tk@3.9"
brew "python@3.10"
brew "python@3.11"
brew "rust"
brew "s3cmd"
brew "solidity"
brew "spatialite-tools"
brew "trash"
brew "wget"
brew "woff2"
brew "yt-dlp"
brew "z"
brew "zlib"
brew "zsh"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "dart-lang/dart/dart"
brew "heroku/brew/heroku"
brew "osx-cross/arm/arm-gcc-bin@8"
brew "osx-cross/avr/avr-binutils"
brew "qmk/qmk/qmk"
brew "sass/sass/sass"
brew "teamookla/speedtest/speedtest"
cask "1password"
cask "alfred"
cask "anylist"
cask "backblaze"
cask "backblaze-downloader"
cask "balenaetcher"
cask "cleanshot"
cask "discord"
cask "docker"
cask "dozer"
cask "fig"
cask "figma"
cask "finicky"
cask "firefox"
cask "font-input"
cask "font-inter"
cask "google-chrome"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "hazeover"
cask "inkscape"
cask "iterm2"
cask "kitematic"
cask "logitech-options"
cask "microsoft-edge"
cask "monitorcontrol"
cask "ngrok"
cask "nightfall"
cask "openvpn-connect"
cask "postman"
cask "postman-cli"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlvideo"
cask "qmk-toolbox"
cask "quicklook-csv"
cask "quicklook-json"
cask "raycast"
cask "rectangle"
cask "reminders-menubar"
cask "rocket"
cask "slack"
cask "the-unarchiver"
cask "transmit"
cask "via"
cask "visual-studio-code"
mas "Hand Mirror", id: 1502839586
vscode "alefragnani.project-manager"
vscode "alefragnani.rtf"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "astro-build.astro-vscode"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bradlc.vscode-tailwindcss"
vscode "chouzz.vscode-better-align"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "ciantic.keymapceditor-vsc"
vscode "codezombiech.gitignore"
vscode "cssho.vscode-svgviewer"
vscode "csstools.postcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "github.codespaces"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "gitlab.gitlab-workflow"
vscode "grapecity.gc-excelviewer"
vscode "jock.svg"
vscode "jsynowiec.vscode-insertdatestring"
vscode "juanblanco.solidity"
vscode "khaeransori.json2csv"
vscode "killalau.vscode-liquid-snippets"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "lamartire.git-indicators"
vscode "marksdk.midt"
vscode "mblode.twig-language-2"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.fluent-icons"
vscode "mohsen1.prettify-json"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools"
vscode "natemoo-re.vscode-stencil-tools"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "pflannery.vscode-versionlens"
vscode "pranaygp.vscode-css-peek"
vscode "qezhu.gitlink"
vscode "randomfractalsinc.geo-data-viewer"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "ronnidc.nunjucks"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "sissel.shopify-liquid"
vscode "stylelint.vscode-stylelint"
vscode "svelte.svelte-vscode"
vscode "tintinweb.graphviz-interactive-preview"
vscode "tintinweb.solidity-visual-auditor"
vscode "tintinweb.vscode-ethover"
vscode "tintinweb.vscode-inline-bookmarks"
vscode "tintinweb.vscode-solidity-flattener"
vscode "tintinweb.vscode-solidity-language"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "tyriar.sort-lines"
vscode "vincaslt.highlight-matching-tag"
vscode "vscode-icons-team.vscode-icons"
vscode "xaver.clang-format"
vscode "yummygum.city-lights-icon-vsc"
vscode "yzhang.markdown-all-in-one"
vscode "zignd.html-css-class-completion"
vscode "ziyasal.vscode-open-in-github"
