tap "dart-lang/dart"
tap "ethereum/ethereum"
tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "sass/sass"
brew "act"
brew "automake"
brew "libusb"
brew "libusb-compat"
brew "avrdude"
brew "python@3.9"
brew "awscli"
brew "bat"
brew "bootloadhid"
brew "brew-cask-completion"
brew "glib"
brew "cairo"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "clang-format"
brew "coreutils"
brew "dfu-programmer"
brew "dfu-util"
brew "diff-so-fancy"
brew "exa"
brew "guile"
brew "gnutls"
brew "gobject-introspection"
brew "harfbuzz"
brew "leptonica"
brew "libass"
brew "libbluray"
brew "ffmpeg"
brew "fx"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "gifsicle"
brew "gifski"
brew "git"
brew "git-delta"
brew "gitlab-runner"
brew "glab"
brew "glow"
brew "graphicsmagick"
brew "htop"
brew "hub"
brew "imagemagick"
brew "libyaml"
brew "mas"
brew "neovim"
brew "nginx"
brew "nmap"
brew "nvm"
brew "opencv", link: false
brew "python-tk@3.9"
brew "s3cmd"
brew "solidity"
brew "wget"
brew "woff2"
brew "youtube-dl"
brew "zlib"
brew "zsh"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "dart-lang/dart/dart"
brew "heroku/brew/heroku"
brew "osx-cross/arm/arm-gcc-bin@8", link: true
brew "osx-cross/avr/avr-binutils"
brew "qmk/qmk/qmk"
brew "sass/sass/sass"
cask "1password"
cask "alfred"
cask "anylist"
cask "backblaze"
cask "balenaetcher"
cask "discord"
cask "docker"
cask "dozer"
cask "fig"
cask "figma"
cask "finicky"
cask "firefox"
cask "font-input"
cask "font-inter"
cask "google-chrome"
cask "gpg-suite"
cask "hazeover"
cask "inkscape"
cask "iterm2"
cask "kitematic"
cask "logitech-options"
cask "monitorcontrol"
cask "nightfall"
cask "openvpn-connect"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlvideo"
cask "qmk-toolbox"
cask "quicklook-csv"
cask "quicklook-json"
cask "rectangle"
cask "rocket"
cask "slack"
cask "the-unarchiver"
cask "transmit"
cask "visual-studio-code"
