tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
brew "zstd"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "pycparser"
brew "cffi"
brew "openssl@3"
brew "cryptography"
brew "python@3.12"
brew "awscli"
brew "bat"
brew "brew-cask-completion"
brew "glib"
brew "cairo"
brew "coreutils"
brew "curl"
brew "diff-so-fancy"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "leptonica"
brew "libass"
brew "libbluray"
brew "libmicrohttpd"
brew "librist"
brew "pango"
brew "tesseract"
brew "ffmpeg@6"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "gh"
brew "gifski", link: false
brew "git"
brew "mas"
brew "nmap"
brew "node"
brew "openblas"
brew "numpy"
brew "nvm"
brew "openvpn"
brew "postgresql@14", restart_service: true
brew "protobuf"
brew "python@3.11"
brew "trash"
brew "wget"
brew "z"
brew "zlib"
brew "zsh"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
cask "1password"
cask "anylist"
cask "backblaze"
cask "backblaze-downloader"
cask "cleanshot"
cask "cursor"
cask "docker"
cask "figma"
cask "font-input"
cask "font-inter"
cask "google-chrome"
cask "google-cloud-sdk"
cask "gpg-suite"
cask "iterm2"
cask "logitech-options"
cask "ngrok"
cask "nightfall"
cask "openvpn-connect"
cask "postman"
cask "postman-cli"
cask "qmk-toolbox"
cask "slack"
cask "visual-studio-code"
vscode "alefragnani.project-manager"
vscode "alefragnani.rtf"
vscode "astro-build.astro-vscode"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bradlc.vscode-tailwindcss"
vscode "chouzz.vscode-better-align"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "ciantic.keymapceditor-vsc"
vscode "codezombiech.gitignore"
vscode "csstools.postcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "github.codespaces"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "gitlab.gitlab-workflow"
vscode "grapecity.gc-excelviewer"
vscode "jebbs.plantuml"
vscode "jock.svg"
vscode "jsynowiec.vscode-insertdatestring"
vscode "juanblanco.solidity"
vscode "khaeransori.json2csv"
vscode "killalau.vscode-liquid-snippets"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "lamartire.git-indicators"
vscode "marksdk.midt"
vscode "mblode.twig-language-2"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.fluent-icons"
vscode "mohsen1.prettify-json"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools"
vscode "natemoo-re.vscode-stencil-tools"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "pflannery.vscode-versionlens"
vscode "pranaygp.vscode-css-peek"
vscode "qezhu.gitlink"
vscode "randomfractalsinc.geo-data-viewer"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "ronnidc.nunjucks"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "sissel.shopify-liquid"
vscode "stylelint.vscode-stylelint"
vscode "svelte.svelte-vscode"
vscode "tintinweb.graphviz-interactive-preview"
vscode "tintinweb.solidity-visual-auditor"
vscode "tintinweb.vscode-ethover"
vscode "tintinweb.vscode-inline-bookmarks"
vscode "tintinweb.vscode-solidity-flattener"
vscode "tintinweb.vscode-solidity-language"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "tyriar.sort-lines"
vscode "vincaslt.highlight-matching-tag"
vscode "vscode-icons-team.vscode-icons"
vscode "xaver.clang-format"
vscode "yummygum.city-lights-icon-vsc"
vscode "yzhang.markdown-all-in-one"
vscode "zignd.html-css-class-completion"
vscode "ziyasal.vscode-open-in-github"
